Revit 2027 API
ArgumentException Class
The exception that is thrown when one of the arguments provided to a method is not valid.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 More
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ArgumentException : ApplicationException
<SerializableAttribute>
Public Class ArgumentException
	Inherits ApplicationException
[SerializableAttribute]
public ref class ArgumentException : public ApplicationException
[<SerializableAttribute>]
type ArgumentException =
    class
        inherit ApplicationException
    end
The ArgumentException type exposes the following members.
Properties
Name | Description
Data | Gets a collection of key/value pairs that provide additional user-defined information about the exception.
(Inherited from Exception)
FunctionId | The information of the function throwing the exception.
(Inherited from ApplicationException)
HelpLink | Gets or sets a link to the help file associated with this exception.
(Inherited from Exception)
HResult | Gets or sets HRESULT, a coded numerical value that is assigned to a specific exception.
(Inherited from Exception)
InnerException | Gets the Exception instance that caused the current exception.
(Inherited from Exception)
Message | Gets the error message and the parameter name, or only the error message if no parameter name is set.
(Overrides Exception.Message)
ParamName | Gets the name of the parameter that causes this exception.
Source | Gets or sets the name of the application or the object that causes the error.
(Inherited from Exception)
StackTrace | Gets a string representation of the immediate frames on the call stack.
(Inherited from Exception)
TargetSite | Gets the method that throws the current exception.
(Inherited from Exception)
Top
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBaseException | When overridden in a derived class, returns the Exception that is the root cause of one or more subsequent exceptions.
(Inherited from Exception)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
GetType | Gets the runtime type of the current instance.
(Inherited from Exception)
ToString | Creates and returns a string representation of the current exception.
(Inherited from Exception)
Top
Remarks
This is the base class for exceptions that are thrown while validating the arguments to a function.
See Also
Reference
Autodesk.Revit.Exceptions Namespace
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 Autodesk.Revit.Exceptions.ArgumentNullException
 Autodesk.Revit.Exceptions.ArgumentOutOfRangeException
 Autodesk.Revit.Exceptions.ArgumentsInconsistentException
 Autodesk.Revit.Exceptions.DirectoryNotEmptyException
 Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException
 Autodesk.Revit.Exceptions.FileArgumentNotFoundException
 Autodesk.Revit.Exceptions.InvalidPathArgumentException